## Cleaning the Data

In [30]:
import pandas as pd

### Cleaning Avg Income and Total Population CSV

In [31]:
avg_income_df = pd.read_csv("../Data/postcode_level_averages.csv")
avg_income_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 27658 entries, 0 to 27657
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   state         27658 non-null  object
 1   zipcode       27658 non-null  int64
 2   total_pop     27658 non-null  int64
 3   total_income  27658 non-null  int64
 4   country       27658 non-null  object
 5   avg_income    27658 non-null  float64
dtypes: float64(1), int64(3), object(2)
memory usage: 1.3+ MB

In [32]:
avg_income_df.head()

  state  zipcode  total_pop  total_income country   avg_income
0    AK        0     345220      25354974     USA  73445.84323
1    AK    99501       7690        612242     USA  79615.34460
2    AK    99502      11860       1000685     USA  84374.78921
3    AK    99503       7510        462394     USA  61570.43941
4    AK    99504      19440       1176109     USA  60499.43416

In [33]:
#checking duplicate row 
avg_income_df.duplicated().sum()

0

In [34]:
#checking number of null columns
avg_income_df.isna().sum()

state           0
zipcode         0
total_pop       0
total_income    0
country         0
avg_income      0
dtype: int64

In [35]:
# Round the avg income to 2 decimals
avg_income_df["avg_income"] = avg_income_df["avg_income"].astype(int)
#Remove country column and total income columns
avg_income_df = avg_income_df[["state", "zipcode", "total_pop", "avg_income"]]

In [36]:
avg_income_df.head()

  state  zipcode  total_pop  avg_income
0    AK        0     345220       73445
1    AK    99501       7690       79615
2    AK    99502      11860       84374
3    AK    99503       7510       61570
4    AK    99504      19440       60499

In [37]:
avg_income_df.set_index("zipcode",inplace=True)

In [38]:
avg_income_df.to_csv("../cleaned_CSVs/Income_and_population.csv")

### Cleanig of Natural Disasters CSV

In [39]:
disaster_declarations = pd.read_csv("../Data/us_disaster_declarations.csv")
disaster_declarations.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 59392 entries, 0 to 59391
Data columns (total 22 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   fema_declaration_string     59392 non-null  object
 1   disaster_number             59392 non-null  int64
 2   state                       59392 non-null  object
 3   declaration_type            59392 non-null  object
 4   declaration_date            59392 non-null  object
 5   fy_declared                 59392 non-null  int64
 6   incident_type               59392 non-null  object
 7   declaration_title           59392 non-null  object
 8   ih_program_declared         59392 non-null  int64
 9   ia_program_declared         59392 non-null  int64
 10  pa_program_declared         59392 non-null  int64
 11  hm_program_declared         59392 non-null  int64
 12  incident_begin_date         59392 non-null  object
 13  incident_end_date           51226 non-null  object
 14  disaster_closeout_date      3080 non-null   object
 15  fips                        59392 non-null  int64
 16  place_code                  59392 non-null  int64
 17  designated_area             59392 non-null  object
 18  declaration_request_number  59392 non-null  int64
 19  hash                        59318 non-null  object
 20  last_refresh                59392 non-null  object
 21  id                          59392 non-null  object
dtypes: int64(9), object(13)
memory usage: 10.0+ MB

In [40]:
disaster_declarations.head()

,fema_declaration_string,disaster_number,state,declaration_type,declaration_date,fy_declared,incident_type,declaration_title,ih_program_declared,ia_program_declared,...,incident_begin_date,incident_end_date,disaster_closeout_date,fips,place_code,designated_area,declaration_request_number,hash,last_refresh,id
0,DR-1-GA,1,GA,DR,1953-05-02T04:00:00Z,1953,Tornado,Tornado,0,1,...,1953-05-02T04:00:00Z,1953-05-02T04:00:00Z,NaN,13000,0,Statewide,53013,2f28952448e0a666d367ca3f854c81ec,2019-07-26T18:49:32Z,5d1bceafd5b39c032f2602bf
1,DR-2-TX,2,TX,DR,1953-05-15T04:00:00Z,1953,Tornado,Tornado & Heavy Rainfall,0,1,...,1953-05-15T04:00:00Z,1953-05-15T04:00:00Z,NaN,48000,0,Statewide,53003,c5a1a4a1030d6730d9c562cdbe7c830f,2019-07-26T18:49:32Z,5d1bceafd5b39c032f2602c3
2,DR-3-LA,3,LA,DR,1953-05-29T04:00:00Z,1953,Flood,Flood,0,1,...,1953-05-29T04:00:00Z,1953-05-29T04:00:00Z,NaN,22000,0,Statewide,53005,745948932fd77a7c6dcd4de7059ff080,2019-07-26T18:49:32Z,5d1bceafd5b39c032f2602c1
3,DR-4-MI,4,MI,DR,1953-06-02T04:00:00Z,1953,Tornado,Tornado,0,1,...,1953-06-02T04:00:00Z,1953-06-02T04:00:00Z,NaN,26000,0,Statewide,53004,8c9dee13124e36a9dfe2eb74e33fafad,2019-07-26T18:49:32Z,5d1bceafd5b39c032f2602c0
4,DR-5-MT,5,MT,DR,1953-06-06T04:00:00Z,1953,Flood,Floods,0,1,...,1953-06-06T04:00:00Z,1953-06-06T04:00:00Z,NaN,30000,0,Statewide,53006,59c5483387ca13c6a3c1bc692f4860e1,2019-07-26T18:49:32Z,5d1bceafd5b39c032f2602c7

In [41]:
#checking duplicate row 
disaster_declarations.duplicated().sum()

0

In [42]:
#checking number of null columns
disaster_declarations.isna().sum()

fema_declaration_string           0
disaster_number                   0
state                             0
declaration_type                  0
declaration_date                  0
fy_declared                       0
incident_type                     0
declaration_title                 0
ih_program_declared               0
ia_program_declared               0
pa_program_declared               0
hm_program_declared               0
incident_begin_date               0
incident_end_date              8166
disaster_closeout_date        56312
fips                              0
place_code                        0
designated_area                   0
declaration_request_number        0
hash                             74
last_refresh                      0
id                                0
dtype: int64

In [43]:
#remove unecessary columns
disaster_declarations = disaster_declarations[["state","declaration_title","declaration_type","fy_declared"]]
disaster_declarations.set_index("state",inplace=True)
disaster_declarations.head()
#declaration type meaning
# "DR" (= major disaster)
# "EM" (= emergency management)
# "FM" (= "fire management")

              declaration_title declaration_type  fy_declared
state
GA                      Tornado               DR         1953
TX     Tornado & Heavy Rainfall               DR         1953
LA                        Flood               DR         1953
MI                      Tornado               DR         1953
MT                       Floods               DR         1953

In [44]:
# Output in a csv
disaster_declarations.to_csv("../cleaned_CSVs/natural_disasters.csv")